In [ ]:
# DYNAMIC PROGRAMMING

'''
first solve the smallest problem (eg.floor 0,floor 1)
store answer in lit or table
build bigger answer from small answer.

this is tabulation (bottom - up).

fibo(5) = fibo(4)-fibo(3)
fibo(4)= fibo(3)-fibo(2)

dp[i]=?
'''

In [ ]:
'''
-In 1D DP = the state depended on a single index (like dp[i] for climbing stairs)
-In 2D DP = the state depends on two indices - typically i (row) and j(column)
'''

In [ ]:
'''dp[i][j] = some computed value for cell (i, j) in a table/grid.
Example:
    For counting paths = number of ways to reach (i, j)
    For min cost path = minimum sum to reach (i, j)

# We have a robot starting at (0, 0), can move right or down.

Transition formula
for 1D= dp[i]= dp[i-1]+dp[i-2] 

dp[i][j] = dp[i-1][j] + dp[i][j-1] = for 2D
dp[i-1][j]: ways from above
dp[i][j-1]: ways from left

'''

In [3]:
# without DP

def find(x,y,path):
    if x==2 and y==2:
        print(path)
        return     #x-coloumn (down)   , y= row (right)
    if x+1<=2 and grid[x+1][y]==0:
        find(x+1,y,path+"D")
    if y+1<=2 and grid[x][y+1]==0:
        find(x,y+1,path+"R")
grid=[
    [0,0,0],
    [0,1,0],
    [0,0,0]
]

find(0,0,"")

DDRR
RRDD

In [4]:
# with DP

def find(x,y,path,memo):
    if x==2 and y==2:
        return [path]
    if (x,y,path) in memo:
        return memo[(x,y,path)]
    paths=[]
    # move down
    if x+1 <=2 and grid[x+1][y]==0:
        paths+=find(x+1,y,path+"D",memo)
    # move right
    if y+1 <=2 and grid[x][y+1]==0:
        paths+=find(x,y+1,path+"R",memo)

    memo[(x,y,path)]=paths
    return paths
grid=[
    [0,0,0],
    [0,1,0],
    [0,0,0]
]

# to you this function
memo={}
all_paths=find(0,0,"",memo)
print(all_paths)

['DDRR', 'RRDD']

In [5]:
# all path finding

# with out dp

def find(x,y,path):
    if x==2 and y==2:
        print(path)
        return     #x-coloumn (down)   , y= row (right)
    if x+1<=2 and grid[x+1][y]==0:
        find(x+1,y,path+"D")
    if y+1<=2 and grid[x][y+1]==0:
        find(x,y+1,path+"R")
grid=[
    [0,0,0],
    [0,0,0],
    [0,0,0]
]

find(0,0,"")

DDRR
DRDR
DRRD
RDDR
RDRD
RRDD

In [6]:
# with dp find all path 

def find(x,y,path,memo):
    if x==2 and y==2:
        return [path]
    if (x,y,path) in memo:
        return memo[(x,y,path)]
    paths=[]
    # move down
    if x+1 <=2 and grid[x+1][y]==0:
        paths+=find(x+1,y,path+"D",memo)
    # move right
    if y+1 <=2 and grid[x][y+1]==0:
        paths+=find(x,y+1,path+"R",memo)

    memo[(x,y,path)]=paths
    return paths
grid=[
    [0,0,0],
    [0,0,0],
    [0,0,0]
]

# to you this function
memo={}
all_paths=find(0,0,"",memo)
print(all_paths)

['DDRR', 'DRDR', 'DRRD', 'RDDR', 'RDRD', 'RRDD']

In [7]:
# fiding all path without zero
def find(x,y,path):
    if x==2 and y==2:
        print(path)
        return     #x-coloumn (down)   , y= row (right)
    if x+1<=2 and grid[x+1][y]!=0:
        find(x+1,y,path+"D")
    if y+1<=2 and grid[x][y+1]!=0:
        find(x,y+1,path+"R")
grid=[
    [1,5,3],
    [2,4,8],
    [9,6,7]
]

find(0,0,"")

DDRR
DRDR
DRRD
RDDR
RDRD
RRDD

In [27]:

def find(x,y,path):
    
    if x==2 and y==2:
        print(path)
        
        return 1     #x-coloumn (down)   , y= row (right)
    count=0
    
    if x+1<=2 and grid[x+1][y]==0:
        count+=find(x+1,y,path+"D")
    if y+1<=2 and grid[x][y+1]==0:
        count+=find(x,y+1,path+"R")
    return count
grid=[
    [0,0,0],
    [0,0,0],
    [0,0,0]
]

find(0,0,"")

DDRR
DRDR
DRRD
RDDR
RDRD
RRDD

6

In [ ]:
# LONGEST SUBSTRING WITHOUT REPEATING
# INPUT-"abcabcbb"
# without Dp

def l_s(s):
    n=len(s)
    m_l=0
    for i in range(n):
        seen=set()
        for j in range(i,n):
            if s[j]in seen:
                break
            seen.add(s[j])
            m_l=max(m_l,j-i+1)
    return m_l # abc is the longest sub string
l_s("abcabcbb")

3

In [29]:
# with Dp


def longest_unique_substring(s):
    last_seen = {}  # store last position of each char
    dp = [0] * len(s)  # dp[i] = longest unique substring ending at i
    max_len = 0

    for i in range(len(s)):
        if s[i] in last_seen:
            distance = i - last_seen[s[i]]
            dp[i] = min(dp[i - 1] + 1, distance)
        else:
            dp[i] = dp[i - 1] + 1 if i > 0 else 1

        last_seen[s[i]] = i
        max_len = max(max_len, dp[i])

    return max_len

print(longest_unique_substring("abcabcbb"))

3

In [ ]:
# fiding the min  path  sum
def find(x,y,cost):
    if x==2 and y==2:
        # print(path)
        return cost +grid[x][y]     #x-coloumn (down)   , y= row (right)
    costs=[]
    if x+1<=2:
        costs.append(find(x+1,y,cost+grid[x][y]))
    if y+1<=2:
        costs.append(find(x,y+1,cost+grid[x][y]))
    return min(costs)
grid=[
    [2,1,1],
    [1,5,1],
    [1,4,1]
]

find(0,0,0)

6

In [49]:
# CSV - TSV

import csv

with open(r"C:\Users\hp\Downloads\File handle\Book1.csv","r") as csvfile:
    reader = csv.reader(csvfile)
    rows=list(reader)  #READ ALL ROWS INTO A LIST

with open("data_converted_to_tsv.tsv","w",newline="") as tsvfile:
    writer=csv.writer(tsvfile,delimiter="\t") # delimeter is tab here it changes the coma to space
    writer.writerows(rows)
print("converted csv to tsv successfully!!")

converted csv to tsv successfully!!

In [50]:
import csv
with open(r"Book1.csv",encoding="utf-8",newline="") as f:
    reader=csv.DictReader(f)
    for row in reader:
        # row is an orderdict : column_name -> value
        print(row["name"],row["salary"])

richu 1000
godson 2500
abhi 2
akash 1
noufal 0
razeen -1
jameela 1000000
shaz 100000
sandra 9000
fady 3000
mufeed 200
fiza 500
minha 3
abishek 6
athulyaa 4
kiran 0
kishore 100000000
manu 300000
raju 500

In [53]:
# NORMALIZATION

import csv

with open(r"C:\Users\hp\Downloads\File handle\Book1.csv","r") as infile:
    reader=csv.reader(infile)
    rows=list(reader)

# clean headers : trim spaces and lowercase
    header =[h.strip().lower() for h in rows[0]]

# clean data rows: trim spaces from each value
cleaned_rows=[header]
for row in rows[1:]:
    cleaned_row=[val.strip() for val in row]
    cleaned_rows.append(cleaned_row)

# write cleaned csv
with open("cleaned_data.csv","w",newline="") as outfile:
    writer = csv.writer(outfile)
    writer.writerows(cleaned_rows)

print("CSV normslized and saved as cleaned_data.csv")

CSV normslized and saved as cleaned_data.csv

In [68]:
import pandas as pd

data =pd.read_csv("Book1.csv")
print(data)

    SI.NO      name       salary
0       1     richu       1000.0
1       2    godson       2500.0
2       3      abhi          2.0
3       4     akash          NaN
4       5    noufal          0.0
5       6    razeen         -1.0
6       7   jameela    1000000.0
7       8      shaz     100000.0
8       9    sandra       9000.0
9      10      fady          NaN
10     11    mufeed        200.0
11     12      fiza        500.0
12     13     minha          3.0
13     14   abishek          6.0
14     15  athulyaa          4.0
15     16     kiran          0.0
16     17   kishore  100000000.0
17     18      manu     300000.0
18     19      raju        500.0

In [55]:
data.head(5)   # it gives the first 5

   SI.NO    name  salary
0      1   richu    1000
1      2  godson    2500
2      3    abhi       2
3      4   akash       1
4      5  noufal       0

In [56]:
data.tail() # it gives the last 5

    SI.NO      name     salary
14     15  athulyaa          4
15     16     kiran          0
16     17   kishore  100000000
17     18      manu     300000
18     19      raju        500

In [57]:
data.info()    #it gives the all informations

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SI.NO   19 non-null     int64
 1   name    19 non-null     object
 2   salary  19 non-null     int64
dtypes: int64(2), object(1)
memory usage: 588.0+ bytes

In [ ]:
data.describe()  #it apply the statistics for number colums(like mean ,median ,count etc...)

           SI.NO        salary
count  19.000000  1.900000e+01
mean   10.000000  5.337722e+06
std     5.627314  2.292471e+07
min     1.000000 -1.000000e+00
25%     5.500000  2.500000e+00
50%    10.000000  5.000000e+02
75%    14.500000  6.000000e+03
max    19.000000  1.000000e+08

In [69]:
data.isnull().sum()  # it gives the count of missing data(empty column) in the table

SI.NO     0
name      0
salary    2
dtype: int64

In [70]:
data.dropna # drop the colums row wise if there any missing values

<bound method DataFrame.dropna of     SI.NO      name       salary
0       1     richu       1000.0
1       2    godson       2500.0
2       3      abhi          2.0
3       4     akash          NaN
4       5    noufal          0.0
5       6    razeen         -1.0
6       7   jameela    1000000.0
7       8      shaz     100000.0
8       9    sandra       9000.0
9      10      fady          NaN
10     11    mufeed        200.0
11     12      fiza        500.0
12     13     minha          3.0
13     14   abishek          6.0
14     15  athulyaa          4.0
15     16     kiran          0.0
16     17   kishore  100000000.0
17     18      manu     300000.0
18     19      raju        500.0>

In [ ]:
data.fillna(100)   #replace a value if any null spaces with given value

    SI.NO      name       salary
0       1     richu       1000.0
1       2    godson       2500.0
2       3      abhi          2.0
3       4     akash        100.0
4       5    noufal          0.0
5       6    razeen         -1.0
6       7   jameela    1000000.0
7       8      shaz     100000.0
8       9    sandra       9000.0
9      10      fady        100.0
10     11    mufeed        200.0
11     12      fiza        500.0
12     13     minha          3.0
13     14   abishek          6.0
14     15  athulyaa          4.0
15     16     kiran          0.0
16     17   kishore  100000000.0
17     18      manu     300000.0
18     19      raju        500.0